var CITY = {
    "北京": ["清华大学", "北京大学", "CERNET国家网络中心", "北京市教育和科研计算机网", "北京化工大学", "北京邮电大学", "北京航空航天大学", "北方交通大学", "北京医科大学", "北京农业大学", "北京工业大学", "北京师范大学", "北京中医药大学", "中国地质大学(北京)", "燕京研究院", "北京教育学院", "中国人民大学", "北京协和医科大学", "北京林业大学", "石油大学(北京)", "首都师范大学", "中国矿业大学北京研究生部", "中央音乐学院", "北京语言文化大学", "中央广播电视大学", "北京理工大学", "北京科技大学", "北方工业大学", "中国青年政治学院", "首都医科大学", "对外经济贸易大学", "北京新亚研修学院", "中国农业大学(东区)", "北京外国语大学", "北京电影学院", "北京广播学院", "北京体育大学", "首钢工学院", "首都经济贸易大学", "北京信息工程学院", "中国政法大学", "中美工商管理研修学院", "北京东方大学", "华北电力大学(北京)", "外交学院", "北京印刷学院", "海淀走读大学", "北京工商大学"],
    "天津": [, "天津大学", "南开大学", "中国民用航空学院", "河北工业大学", "天津师范大学", "中国旅游管理干部学院", "天津医科大学", "天津商学院", "天津城市建设学院", "天津理工学院", "天津财经学院", "天津中医学院", "天津广播电视大学", "天津企业管理培训中心", "天津开发区国际学校", "天津美术学院", "天津音乐学院"],
    "河北": ["河北大学", "石家庄铁道学院", "燕山大学", "石家庄邮政高等专科学校", "河北师范大学", "河北科技大学", "邢台职业技术学院", "石家庄职业技术学院", "东北大学秦皇岛分校", "河北广播电视大学", "河北经贸大学", "河北医科大学", "河北农业大学"],
    "辽宁": ["东北大学", "辽宁大学", "大连理工大学", "抚顺石油学院", "沈阳电力高等专科学校", "沈阳工业学院", "中国医科大学", "大连铁道学院", "辽宁教育和科研计算机网", "鞍山师范学院", "沈阳大学", "大连海事大学", "沈阳航空工业学院", "沈阳建筑工程学院", "大连医科大学", "沈阳工业大学", "中国刑事警察学院", "辽宁省交通高等专科学校", "沈阳药科大学", "锦州师范学院", "东北财经大学", "鞍山钢铁学院", "辽宁工程技术大学"],
    "吉林": ["吉林大学", "吉林工业大学", "东北师范大学", "延边科学技术大学", "延边大学", "东北电力学院", "吉林电气化高等专科学校", "长春邮电学院", "吉林工学院", "长春光学精密机械学院", "长春工程学院"],
    "上海": ["上海交通大学", "复旦大学", "同济大学", "华东工业大学", "华东师范大学", "上海医科大学", "上海第二医科大学", "上海大学", "上海铁道大学", "中国纺织大学", "华东理工大学", "上海外国语学院", "上海师范大学", "上海电视大学", "上海纺织高等专科学校", "上海中医药大学", "上海财经大学", "上海海运学院", "上海对外贸易学院", "上海水产大学", "上海第二工业大学", "上海化工高等专科学校"],
    "江苏": ["东南大学", "南京大学", "南京师范大学", "南京农业大学", "南京航空航天大学", "南京医科大学", "南京中医药大学", "南京化工大学", "南京理工大学", "河海大学", "南京气象学院", "苏州大学", "南京林业大学", "无锡轻工大学", "中国矿业大学", "扬州大学", "淮海工学院", "南通医学院", "江苏石油化工学院", "中国药科大学", "江苏石油化工学院", "徐州医学院", "江苏教育和科研计算机网", "华东船舶工业学院", "江苏理工大学", "南京邮电大学", "徐州师范大学", "江苏省邮电学校", "南通纺织职业技术学院", "江南学院", "南通师范学院", "河海大学常州分校", "常熟高等专科学校", "南通工学院", "南京经济学院", "盐城工学院", "镇江医学院", "常州技术师范学院", "盐城师范学院", "镇江市高等专科学校", "南京审计学院", "江苏省盐城商业学校"],
    "浙江": ["浙江大学", "杭州大学", "浙江农业大学", "浙江教育和科研计算机网", "浙江医科大学", "杭州金融管理干部学院", "宁波大学", "浙江师范大学", "浙江工业大学", "杭州商学院", "杭洲电子工业学院", "浙江教育学院", "六横职业技术学校", "绍兴文理学院", "温州师范学院"],
    "安徽": ["中国科技大学", "安徽大学", "合肥工业大学", "安徽教育和科研计算机网", "安徽师范大学", "中国计算机函授学院", "淮南工业学院", "滁州师范专科学校", "安徽合肥三联学院", "合肥电子工程学院", "淮北煤炭师范学院"],
    "福建": ["厦门大学", "福州大学", "福建中医学院", "国立华侨大学", "福建农业大学", "集美大学", "福建师范大学", "福建医科大学", "福建建筑专科学校", "泉州师范高等专科学校", "福建交通职业技术学院"],
    "江西": ["南昌大学", "华东交通大学", "江西财经大学", "江西师范大学", "九江师专", "江西教育学院"],
    "山东": ["山东大学", "烟台大学", "山东建筑工程学院", "山东农业大学", "山东建筑材料工业学院", "曲阜师范大学", "烟台教育学院烟台电视大学", "青岛海洋大学", "青岛大学", "山东工业大学", "石油大学（华东）", "中国煤炭经济学院", "青岛建筑工程学院", "山东矿业学院", "聊城师范学院", "山东财政学院", "山东中医药大学", "山东师范大学", "莱阳农学院", "青岛化工学院", "山东工程学院", "潍坊高等专科学校", "烟台师范"],
    "河南": ["郑州大学", "焦作工学院", "河南医科大学", "安阳师范高等专科学校", "郑州粮食学院", "郑州工业大学", "河南大学", "郑州牧业工程高等专科学校", "河南农业大学", "洛阳工学院", "郑州轻工业学院", "河南师范大学", "黄河科技大学", "华北水利水电学院", "郑州纺织工学院", "平顶山师范高等专科学校"],
    "内蒙": ["内蒙古大学", "内蒙古工业大学", "内蒙古农业大学"],
    "黑龙江": ["哈尔滨工业大学", "哈尔滨工程大学", "哈尔滨理工大学", "东北农业大学", "东北林业大学", "哈尔滨建筑大学", "哈尔滨医科大学", "大庆职工大学", "黑龙江大学", "大庆石油学院", "黑龙江中医药大学", "黑龙江商学院", "哈尔滨师范大学"],
    "湖北": ["华中理工大学", "武汉测绘科技大学", "华中师范大学", "同济医科大学", "武汉水利电力大学", "湖北大学", "武汉汽车工业大学", "中南财经大学", "武汉交通科技大学", "湖北教育学院", "武汉医学院", "江汉石油学院", "武汉大学", "中国地质大学", "武汉水利电力大学(宜昌)", "武汉化工学院", "荆州师范高等专科学校", "武汉教育学院", "武汉城市建设学院", "湖北医科大学", "武汉理工大学", "武汉科技大学", "湖北三峡学院", "华中农业大学"],
    "湖南": ["中南工业大学", "长沙铁道学院", "国防科技大学", "湖南大学", "长沙工学院", "长沙工业高等专科学校", "湘潭大学", "湖南师范大学", "中南林学院", "中南工学院", "长沙电力学院", "CERNET", "湖南主节点", "湘潭师范学院", "焦作工学院", "吉首大学", "株洲工学院", "衡阳医学院", "中南大学"],
    "广东": ["华南理工大学", "中山大学", "暨南大学", "华南师范大学", "广东工业大学", "深圳大学", "汕头大学", "广州大学", "中山医科大学", "广东商学院", "广州师范学院", "佛山大学", "广东外语外贸大学", "华南农业大学", "五邑大学", "广东教育和科研计算机网", "广东医学院", "广州教育学院", "东莞理工学院", "深圳职业技术学院", "广东石油化工高等专科学校", "惠州大学", "湛江师范学院", "第一军医大学"],
    "广西": ["广西大学", "广西师范大学", "桂林电子工业学院", "桂林工学院", "广西师范学院", "广西教育和科研计算机网", "南宁科技信息网", "广西民族大学",],
    "海南": ["海南省师范学院", "海南医学院", "海南大学"],
    "四川": ["电子科技大学", "四川大学", "西南交通大学", "成都理工学院", "华西医科大学", "四川教育和科研计算机网", "西南财经大学", "四川农业大学", "成都中医药大学", "四川工业学院", "西南工学院", "成都气象学院", "绵阳经济技术高等专科学校", "内江师范学院", "四川师范大学", "西南石油学院", "四川师范学院", "乐山师范学院"],
    "重庆": ["重庆大学", "重庆邮电学院", "重庆建筑大学", "西南政法大学", "第三军医大学", "西南农业大学", "重庆医科大学", "重庆交通学院", "重庆后勤工程学院", "西南师范大学", "重庆师范学院"],
    "贵州": ["贵州大学", "贵州工学院", "贵州教育与科研计算机网", "贵州财经学院", "贵州民族学院"],
    "云南": ["云南工业大学", "云南大学", "云南财贸学院", "昆明理工大学", "云南农业大学", "云南师范大学", "云南民族学院", "昆明医学院"],
    "西藏": ["西藏大学"],
    "陕西": ["西安交通大学", "西安公路交通大学", "西北大学", "西安电子科技大学", "西安邮电学院", "西北工业大学", "西安理工大学", "西安建筑科技大学", "西安医科大学", "陕西教育和科研计算机网", "西安石油学院", "西安工业学院", "第四军医大学", "陕西师范大学", "陕西财经学院", "西北纺织工学院", "西北农林科技大学"],
    "甘肃": ["兰州大学", "兰州铁道学院", "甘肃工业大学", "西北师范大学", "甘肃农业大学", "兰州商学院", "兰州工业高等专科学校", "天水师范学院"],
    "青海": ["青海大学", "青海师范大学", "青海广播电视大学"],
    "宁夏": ["宁夏大学", "宁夏医学院", "西北第二民族学院"],
    "新疆": ["新疆大学", "新疆财经学院", "新疆石油学院", "新疆农业大学", "乌鲁木齐职业大学", "新疆工学院", "塔里木大学"],
    "香港": ["香港中文大学", "香港城市大学", "香港理工大学", "香港大学", "香港浸会大学", "香港科技大学", "岭南学院"],
    "澳门": ["澳门大学"],
    "台湾": ["清华大学(台湾)", "交通大学"]
}
function radioHandler() {
    //或取用户身份单选按钮
    var isStudent = document.getElementsByName("isStudent"), s_tab = document.getElementById("school_tab"), c_tab = document.getElementById("company_tab");
    if (isStudent[0].checked) {
        s_tab.className = "";
        c_tab.className = "hide";
    } else {
        s_tab.className = "hide";
        c_tab.className = "";
    }
}
function cityChangeHandler(event) {
    var target = event.target,
        option = target.options[target.selectedIndex].value,
        schools = CITY[option],
        s_select = document.getElementsByName("school")[0],
        items = "";
    schools.forEach(function (element) {
        items += "<option value='" + element + "'>" + element + "</option>"
    });
    s_select.innerHTML = items;
}
function initCitySelect() {
    var citySel = document.getElementsByName("city")[0],
        items = "",
        s_items = "",
        schoolSel = document.getElementsByName("school")[0];
    for (var city in CITY) {
        if (city == "北京") {
            items += "<option value='" + city + "' selected='selected'>" + city + "</option>";
        } else {
            items += "<option value='" + city + "'>" + city + "</option>";
        }
    }
    CITY["北京"].forEach(function (element) {
        s_items += "<option value='" + element + "'>" + element + "</option>"
    });
    schoolSel.innerHTML = s_items;
    citySel.innerHTML = items;
    citySel.addEventListener("change", cityChangeHandler);
}
initCitySelect();
var radioDiv = document.getElementById("radio_div");
radioDiv.addEventListener("click", radioHandler);